stm32-rs/stm32l4xx-hal/src/serial.rs
//! Serial

use as_slice::AsMutSlice;
use cast::u16;
use core::fmt;
use core::marker::PhantomData;
use core::ops::DerefMut;
use core::ptr;
use core::sync::atomic::{self, Ordering};
use stable_deref_trait::StableDeref;

use crate::hal::serial::{self, Write};
use nb;

use crate::stm32::{USART1, USART2};

// TODO USART3RST is missing atm in stm32l4x1 & stm32l4x2 crate
// Related issue: https://github.com/stm32-rs/stm32-rs/issues/243
#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::stm32::USART3;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::stm32::UART4;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::stm32::UART5;

use crate::gpio::gpioa::{PA0, PA1, PA10, PA11, PA12, PA2, PA3, PA9};
use crate::gpio::gpiob::{PB3, PB4, PB6, PB7};
use crate::gpio::gpiod::{PD3, PD4, PD5, PD6};
use crate::gpio::{Alternate, Floating, Input, AF7};

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioa::PA6;

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpiob::{PB1, PB10, PB11, PB13, PB14};

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpiod::{PD11, PD12, PD2};

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioc::{PC10, PC11, PC4, PC5};

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioa::PA15;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpiob::PB5;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioc::PC12;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::AF8;

use crate::dma::{dma1, CircBuffer, FrameReader};
use crate::rcc::{Clocks, APB1R1, APB2};
use crate::time::{Bps, U32Ext};

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::dma::dma2;

/// Interrupt event
pub enum Event {
    /// New data has been received
    Rxne,
    /// New data can be sent
    Txe,
    /// The line has gone idle
    Idle,
    /// Character match
    CharacterMatch,
}

/// Serial error
#[derive(Debug)]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
    #[doc(hidden)]
    _Extensible,
}

pub trait Pins<USART> {
    const FLOWCTL: bool;
    const DEM: bool;
}

macro_rules! pins {
    // Hardware flow control, Rx+Tx+Rts+Cts
    ($(
        $(#[$meta:meta])*
        $USARTX:ident: (
            $tx:ident,
            $rx:ident,
            $rts:ident,
            $cts:ident,
            $af:ident
        ),
    )+) => {
        $(
            impl Pins<$USARTX> for ($tx<Alternate<$af, Input<Floating>>>, $rx<Alternate<$af, Input<Floating>>>, $rts<Alternate<$af, Input<Floating>>>, $cts<Alternate<$af, Input<Floating>>>) {
                const FLOWCTL: bool = true;
                const DEM: bool = false;
            }
        )+
    };

    // DEM for RS485 mode
    ($(
        $(#[$meta:meta])*
        $USARTX:ident: (
            $tx:ident,
            $rx:ident,
            $de:ident,
            $af:ident
        ),
    )+) => {
        $(
            impl Pins<$USARTX> for ($tx<Alternate<$af, Input<Floating>>>, $rx<Alternate<$af, Input<Floating>>>, $de<Alternate<$af, Input<Floating>>>) {
                const FLOWCTL: bool = false;
                const DEM: bool = true;
            }
        )+
    };

    // No flow control, just Rx+Tx
    ($(
        $(#[$meta:meta])*
        $USARTX:ident: (
            $tx:ident,
            $rx:ident,
            $af:ident
        ),
    )+) => {
        $(
            impl Pins<$USARTX> for ($tx<Alternate<$af, Input<Floating>>>, $rx<Alternate<$af, Input<Floating>>>) {
                const FLOWCTL: bool = false;
                const DEM: bool = false;
            }
        )+
    };
}

// USART 1
pins! {
    // USART1: (tx: (PA9, PB6), rx: (PA10, PB7), rts: (PA12, PB3), cts: (PA11, PB4), AF7),
    USART1: (PA9, PA10, AF7),
    USART1: (PB6, PA10, AF7),
    USART1: (PA9, PB7, AF7),
    USART1: (PB6, PB7, AF7),
}

pins! {
    USART1: (PA9, PA10, PA12, PA11, AF7),
    USART1: (PA9, PA10, PA12, PB4, AF7),
    USART1: (PA9, PA10, PB3, PA11, AF7),
    USART1: (PA9, PA10, PB3, PB4, AF7),
    USART1: (PB6, PA10, PA12, PA11, AF7),
    USART1: (PB6, PA10, PA12, PB4, AF7),
    USART1: (PB6, PA10, PB3, PA11, AF7),
    USART1: (PB6, PA10, PB3, PB4, AF7),
    USART1: (PA9, PB7, PA12, PA11, AF7),
    USART1: (PA9, PB7, PA12, PB4, AF7),
    USART1: (PA9, PB7, PB3, PA11, AF7),
    USART1: (PA9, PB7, PB3, PB4, AF7),
    USART1: (PB6, PB7, PA12, PA11, AF7),
    USART1: (PB6, PB7, PA12, PB4, AF7),
    USART1: (PB6, PB7, PB3, PA11, AF7),
    USART1: (PB6, PB7, PB3, PB4, AF7),
}

pins! {
    USART1: (PA9, PA10, PA12, AF7),
    USART1: (PA9, PA10, PB3,  AF7),
    USART1: (PB6, PA10, PA12, AF7),
    USART1: (PB6, PA10, PB3,  AF7),
    USART1: (PA9, PB7,  PA12, AF7),
    USART1: (PA9, PB7,  PB3,  AF7),
    USART1: (PB6, PB7,  PA12, AF7),
    USART1: (PB6, PB7,  PB3,  AF7),
}

// USART 2
pins! {
    // USART2: (tx: (PA2, PD5), rx: (PA3, PD6), rts: (PA1, PD4), cts: (PA0, PD3), AF7),
    USART2: (PA2, PA3, AF7),
    USART2: (PD5, PA3, AF7),
    USART2: (PA2, PD6, AF7),
    USART2: (PD5, PD6, AF7),
}

pins! {
    USART2: (PA2, PA3, PA1, PA0, AF7),
    USART2: (PA2, PA3, PA1, PD3, AF7),
    USART2: (PA2, PA3, PD4, PA0, AF7),
    USART2: (PA2, PA3, PD4, PD3, AF7),
    USART2: (PD5, PA3, PA1, PA0, AF7),
    USART2: (PD5, PA3, PA1, PD3, AF7),
    USART2: (PD5, PA3, PD4, PA0, AF7),
    USART2: (PD5, PA3, PD4, PD3, AF7),
    USART2: (PA2, PD6, PA1, PA0, AF7),
    USART2: (PA2, PD6, PA1, PD3, AF7),
    USART2: (PA2, PD6, PD4, PA0, AF7),
    USART2: (PA2, PD6, PD4, PD3, AF7),
    USART2: (PD5, PD6, PA1, PA0, AF7),
    USART2: (PD5, PD6, PA1, PD3, AF7),
    USART2: (PD5, PD6, PD4, PA0, AF7),
    USART2: (PD5, PD6, PD4, PD3, AF7),
}

